rowanhout/onairlight/firmware/onair-esp32/onair-esp32.ino
// ============================================================================
// onair-esp32.ino  --  Firmware voor de On-Air Lamp (ESP32 + bedraad Ethernet)
// ============================================================================
//
// Werking in het kort:
//  - De ESP32 heeft bedraad Ethernet (PoE, LAN8720) en verbindt als WebSocket-
//    CLIENT met de centrale FastAPI-server op pad /ws/device.
//  - De server stuurt aan/uit-commando's; de ESP32 schakelt de lamp en stuurt
//    daarna zijn werkelijke status terug.
//  - Periodiek stuurt de ESP32 een heartbeat (ping) zodat de server hem als
//    online ziet.
//
// Protocol (JSON-tekstberichten):
//   server -> esp:  {"type":"command","state":true|false}
//                   {"type":"pong"}                          (negeren)
//   esp -> server:  {"type":"state","state":true|false}      (bij wijziging + na connect)
//                   {"type":"ping"}                           (heartbeat)
//
// VEILIGE DEFAULT: bij opstart staat de lamp UIT, en wel VOORDAT het netwerk
// wordt gestart, zodat een herstart nooit per ongeluk de ON-AIR-lamp aanzet.
// ----------------------------------------------------------------------------

#include "config.h"
#include "certs.h"              // root-certificaten voor wss://

#include <ETH.h>
#include <WiFi.h>               // levert WiFi.onEvent + ARDUINO_EVENT_ETH_* events
#include <WiFiClientSecure.h>   // voor de TLS-meting in de zelftest
#include <esp_heap_caps.h>      // om het vrije interne geheugen te kunnen meten

// Wil je de interne logging van de WebSocket-library zien? Bouw dan met de
// omgeving poe2-debug (zie platformio.ini). Een #define hier werkt niet: de
// library is een eigen vertaaleenheid en ziet macro's uit deze sketch niet.
#include <WebSocketsClient.h>   // links2004/arduinoWebSockets  (>= 2.4.0)
#include <ArduinoJson.h>        // bblanchon/ArduinoJson v7
#include <time.h>

// ===========================================================================
// Board-afhankelijke Ethernet (RMII) configuratie
// ===========================================================================
// Alle PHY-instellingen worden afgeleid uit BOARD (zie config.h). Elke waarde
// is te overrulen door hem in config.h zelf te #definen -- handig als een
// board-revisie bijvoorbeeld een andere klok-modus gebruikt.
//
// We gebruiken bewust OA_-namen: ETH.h definieert zelf al macro's met namen
// als ETH_PHY_ADDR, en die willen we niet herdefinieren.
// Waarden volgens de officiele Olimex-voorbeeldcode en user manual voor de
// ESP32-POE2 (SOFTWARE/ARDUINO/LAN8720-POE2 en SOFTWARE/ESPHOME).
// LET OP: de POE2 gebruikt een WROVER-module; die claimt GPIO16/17 voor PSRAM,
// daarom loopt de Ethernet-klok hier over GPIO0 (en niet GPIO17 zoals op de
// oudere POE/POE-ISO).
#if BOARD == BOARD_OLIMEX_POE2
  #define BOARD_NAAM "Olimex ESP32-POE2"
  #define OA_DEF_PHY_ADDR   0
  #define OA_DEF_PHY_POWER  12
  #define OA_DEF_PHY_MDC    23
  #define OA_DEF_PHY_MDIO   18
  #define OA_DEF_CLK_MODE   ETH_CLOCK_GPIO0_OUT
  #define OA_DEF_LAMP_PIN   4
#elif BOARD == BOARD_OLIMEX_POE_ISO
  #define BOARD_NAAM "Olimex ESP32-POE-ISO"
  #define OA_DEF_PHY_ADDR   0
  #define OA_DEF_PHY_POWER  12
  #define OA_DEF_PHY_MDC    23
  #define OA_DEF_PHY_MDIO   18
  #define OA_DEF_CLK_MODE   ETH_CLOCK_GPIO17_OUT
  #define OA_DEF_LAMP_PIN   32
#elif BOARD == BOARD_WT32_ETH01
  #define BOARD_NAAM "WT32-ETH01"
  #define OA_DEF_PHY_ADDR   1
  #define OA_DEF_PHY_POWER  16
  #define OA_DEF_PHY_MDC    23
  #define OA_DEF_PHY_MDIO   18
  #define OA_DEF_CLK_MODE   ETH_CLOCK_GPIO0_IN
  #define OA_DEF_LAMP_PIN   4
#else
  #error "Onbekend BOARD in config.h (kies BOARD_OLIMEX_POE2, BOARD_OLIMEX_POE_ISO of BOARD_WT32_ETH01)"
#endif

// Board-defaults toepassen, tenzij config.h ze al heeft gezet.
#ifndef OA_PHY_ADDR
  #define OA_PHY_ADDR OA_DEF_PHY_ADDR
#endif
#ifndef OA_PHY_POWER
  #define OA_PHY_POWER OA_DEF_PHY_POWER
#endif
#ifndef OA_PHY_MDC
  #define OA_PHY_MDC OA_DEF_PHY_MDC
#endif
#ifndef OA_PHY_MDIO
  #define OA_PHY_MDIO OA_DEF_PHY_MDIO
#endif
#ifndef OA_CLK_MODE
  #define OA_CLK_MODE OA_DEF_CLK_MODE
#endif
#ifndef BOARD_LAMP_PIN
  #define BOARD_LAMP_PIN OA_DEF_LAMP_PIN
#endif

// De PHY is een LAN8710/LAN8720 op alle ondersteunde borden (register-
// compatibel; de LAN8720-driver werkt voor beide).
#ifndef OA_PHY_TYPE
  #define OA_PHY_TYPE ETH_PHY_LAN8720
#endif

// Poort voor de lokale testmachine, zodat alleen LOKALE_TEST_HOST volstaat.
#ifndef LOKALE_TEST_PORT
  #define LOKALE_TEST_PORT 8000
#endif

// Standaard NTP-servers, zodat een oudere config.h zonder deze instellingen
// gewoon blijft werken.
#ifndef NTP_SERVER_1
  #define NTP_SERVER_1 "pool.ntp.org"
#endif
#ifndef NTP_SERVER_2
  #define NTP_SERVER_2 "time.cloudflare.com"
#endif

// Effectieve lamp-GPIO: gebruik LAMP_PIN uit config.h als die >= 0 is,
// anders de standaard-GPIO van het gekozen bord.
#if LAMP_PIN >= 0
  #define ACTIVE_LAMP_PIN LAMP_PIN
#else
  #define ACTIVE_LAMP_PIN BOARD_LAMP_PIN
#endif

// ===========================================================================
// Globale toestand
// ===========================================================================
WebSocketsClient ws;

static bool lampAan = false;        // huidige werkelijke lampstatus
static bool ethVerbonden = false;   // heeft Ethernet een IP-adres?
static bool wsGestart = false;      // is de WebSocket-client al gestart?
static unsigned long laatsteHeartbeat = 0;

// ===========================================================================
// Helpers
// ===========================================================================

// Eenvoudige URL-encoder voor de query-waarden (id/naam/ruimte). Houdt
// alfanumeriek en -_.~ ongemoeid, codeert al het andere als %XX.
String urlEncode(const String &waarde) {
  String uit;
  const char *hex = "0123456789ABCDEF";
  for (size_t i = 0; i < waarde.length(); i++) {
    char c = waarde.charAt(i);
    if ((c >= '0' && c <= '9') || (c >= 'A' && c <= 'Z') ||
        (c >= 'a' && c <= 'z') || c == '-' || c == '_' || c == '.' || c == '~') {
      uit += c;
    } else if (c == ' ') {
      uit += "%20";
    } else {
      uit += '%';
      uit += hex[(c >> 4) & 0x0F];
      uit += hex[c & 0x0F];
    }
  }
  return uit;
}

#ifdef DNS_FALLBACK
// Sommige netwerken geven via DHCP geen (bruikbare) DNS-server mee. Met
// DNS_FALLBACK in config.h zetten we er zelf een achter.
//
// Let op de volgorde: de server uit DHCP blijft nummer 0, de fallback wordt
// nummer 1. lwIP loopt ze in volgorde af, dus het netwerk zelf houdt voorrang
// en we wijken alleen uit als dat niet antwoordt. Andersom -- de fallback op
// nummer 0 -- gooit de DNS van het netwerk weg, en op netwerken die uitgaand
// DNS-verkeer blokkeren (dezelfde die vaak ook NTP dichtzetten) blijft er dan
// niets over dat wel werkt.
#include <lwip/dns.h>
void zetDnsFallback() {
  ip_addr_t dnsserver;
  if (!ipaddr_aton(DNS_FALLBACK, &dnsserver)) {
    Serial.printf("[eth] ongeldige DNS_FALLBACK: %s\n", DNS_FALLBACK);
    return;
  }

