rowanhout/onairlight/firmware/onair-esp32/onair-esp32.ino
  const ip_addr_t * uitDhcp = dns_getserver(0);
  bool dhcpBruikbaar = (uitDhcp != nullptr) && !ip_addr_isany(uitDhcp);

  dns_setserver(dhcpBruikbaar ? 1 : 0, &dnsserver);
  if (dhcpBruikbaar) {
    Serial.printf("[eth] DNS: %s (netwerk) met %s als reserve\n",
                  ipaddr_ntoa(uitDhcp), DNS_FALLBACK);
  } else {
    Serial.printf("[eth] DNS: netwerk levert er geen, dus %s gebruikt\n",
                  DNS_FALLBACK);
  }
}
#endif

// Stel de lamp-GPIO in op de gewenste stand (active-HIGH).
void setLamp(bool aan) {
  lampAan = aan;
  digitalWrite(ACTIVE_LAMP_PIN, aan ? HIGH : LOW);
  Serial.printf("[lamp] -> %s\n", aan ? "AAN (ON AIR)" : "UIT");
}

// Stuur de werkelijke status naar de server: {"type":"state","state":...}
void sendState() {
  JsonDocument doc;
  doc["type"] = "state";
  doc["state"] = lampAan;
  String payload;
  serializeJson(doc, payload);
  ws.sendTXT(payload);
  Serial.printf("[ws] status verstuurd: %s\n", payload.c_str());
}

// Stuur een heartbeat: {"type":"ping"}
void sendPing() {
  ws.sendTXT("{\"type\":\"ping\"}");
}

// ===========================================================================
// Inkomende WebSocket-berichten verwerken
// ===========================================================================
void verwerkBericht(const char *payload, size_t lengte) {
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload, lengte);
  if (err) {
    Serial.printf("[ws] kon JSON niet parsen: %s\n", err.c_str());
    return;
  }

  const char *type = doc["type"] | "";

  if (strcmp(type, "command") == 0) {
    // Server vraagt om een aan/uit-stand; toepassen en bevestigen.
    bool gewenst = doc["state"] | false;
    Serial.printf("[ws] commando ontvangen: %s\n", gewenst ? "AAN" : "UIT");
    setLamp(gewenst);
    sendState();   // werkelijke status terugmelden
  } else if (strcmp(type, "pong") == 0) {
    // Antwoord op onze heartbeat -> niets te doen.
  } else {
    Serial.printf("[ws] onbekend berichttype genegeerd: '%s'\n", type);
  }
}

// ===========================================================================
// WebSocket-events
// ===========================================================================
void wsEvent(WStype_t type, uint8_t *payload, size_t lengte) {
  switch (type) {
    case WStype_CONNECTED:
      Serial.printf("[ws] verbonden met server: %s\n", (char *)payload);
      // Meld direct na (re)connect onze huidige status. De server stuurt zelf
      // vlak hierna een command met de laatst gewenste stand; die passen we toe.
      sendState();
      break;

    case WStype_TEXT:
      verwerkBericht((const char *)payload, lengte);
      break;

    case WStype_DISCONNECTED:
      Serial.println("[ws] verbinding verbroken, opnieuw proberen...");
      break;

    case WStype_ERROR:
      Serial.println("[ws] WebSocket-fout");
      break;

    default:
      break;
  }
}

// ===========================================================================
// Ethernet-events (volg connectiviteit en print het IP)
// ===========================================================================
void ethEvent(WiFiEvent_t event) {
  switch (event) {
    case ARDUINO_EVENT_ETH_START:
      Serial.println("[eth] gestart");
#ifdef LAMP_HOSTNAME
      ETH.setHostname(LAMP_HOSTNAME);
#endif
      break;

    case ARDUINO_EVENT_ETH_CONNECTED:
      Serial.println("[eth] kabel verbonden (link up)");
      break;

    case ARDUINO_EVENT_ETH_GOT_IP:
      ethVerbonden = true;
      Serial.print("[eth] IP-adres: ");
      Serial.println(ETH.localIP());
      Serial.print("[eth] gateway  : ");
      Serial.println(ETH.gatewayIP());
      Serial.print("[eth] DNS      : ");
      Serial.println(ETH.dnsIP());
      Serial.printf("[eth] snelheid: %d Mbps, %s\n",
                    ETH.linkSpeed(), ETH.fullDuplex() ? "full duplex" : "half duplex");
#ifdef DNS_FALLBACK
      zetDnsFallback();
#endif
      break;

    case ARDUINO_EVENT_ETH_DISCONNECTED:
      ethVerbonden = false;
      Serial.println("[eth] kabel losgekoppeld (link down)");
      break;

    case ARDUINO_EVENT_ETH_STOP:
      ethVerbonden = false;
      Serial.println("[eth] gestopt");
      break;

    default:
      break;
  }
}

// ===========================================================================
// Tijd ophalen via NTP
// ===========================================================================
// Een gewone webserver op een standaardpoort, als ijkpunt. SERVER_HOST kan naar
// een kale TCP-proxy wijzen, en daar draait geen webserver -- niet bruikbaar om
// de tijd op te halen of om te meten of het bord uberhaupt naar buiten mag.
#ifndef CONTROLE_HOST
  #define CONTROLE_HOST "reclamp.madera.video"
#endif
#ifndef CONTROLE_PORT
  #define CONTROLE_PORT 443
#endif

// Een TLS-certificaat heeft een geldigheidsperiode. Zonder kloppende klok denkt
// de ESP32 dat het 1970 is en keurt hij elk certificaat af. Daarom halen we de
// tijd op voordat we verbinden.
//
// Dit blok wordt altijd meegecompileerd, ook bij USE_TLS = false: de zelftest
// gebruikt het om te kunnen meten of TLS op dit netwerk werkt. Bij ws:// wordt
// het tijdens normaal gebruik simpelweg niet aangeroepen.
//
// Alles na deze datum beschouwen we als een echte klok (en niet 1970).
static const time_t TIJD_DREMPEL = 1700000000;

static bool tijdIsGeldig() {
  return time(nullptr) > TIJD_DREMPEL;
}

static void printTijd() {
  time_t nu = time(nullptr);
  struct tm t;
  gmtime_r(&nu, &t);
  Serial.printf("[tijd] %04d-%02d-%02d %02d:%02d:%02d UTC\n",
                t.tm_year + 1900, t.tm_mon + 1, t.tm_mday,
                t.tm_hour, t.tm_min, t.tm_sec);
}

// Reservemethode: haal de tijd uit de "Date:"-header van een gewoon HTTP-
// antwoord. Handig op netwerken waar NTP (UDP-poort 123) geblokkeerd is;
// poort 80 staat vrijwel altijd open. We vragen het aan onze eigen server,
// dus er is geen extra dienst nodig.
static bool zetTijdUitDatumRegel(const String & datum) {
  // Voorbeeld: "Sun, 14 Sep 2026 19:25:00 GMT"
  struct tm t = {};
  if (strptime(datum.c_str(), "%a, %d %b %Y %H:%M:%S", &t) == nullptr) {
    Serial.printf("[tijd] kon datum niet lezen: %s\n", datum.c_str());
    return false;
  }
  time_t epoch = mktime(&t);            // TZ staat op UTC, dus dit klopt
  struct timeval tv = { .tv_sec = epoch, .tv_usec = 0 };
  settimeofday(&tv, nullptr);
  return tijdIsGeldig();
}

static bool tijdViaHttpDate() {
  WiFiClient client;
  // LET OP: WiFiClient::setTimeout() rekent op de ESP32 in SECONDEN.
  client.setTimeout(5);

  // Bewust CONTROLE_HOST en niet SERVER_HOST: wijst SERVER_HOST naar een kale
  // TCP-proxy, dan draait daar geen webserver op poort 80 en is deze stap bij
  // voorbaat kansloos.
  Serial.printf("[tijd] verbinden met %s:80 ...\n", CONTROLE_HOST);
  if (!client.connect(CONTROLE_HOST, 80, 5000)) {   // connect-timeout wel in ms
    Serial.println("[tijd] HTTP-verbinding mislukt (poort 80 dicht?)");
    return false;
  }
  client.print(String("HEAD / HTTP/1.1\r\nHost: ") + CONTROLE_HOST +
               "\r\nConnection: close\r\n\r\n");

  // Zelf de tijd bewaken in plaats van op de stream-timeout vertrouwen.
  String regel;
  bool gelukt = false;
  unsigned long start = millis();
  while (millis() - start < 8000) {
    while (client.available()) {
      char c = (char)client.read();
      if (c == '\r') continue;
      if (c != '\n') {
        if (regel.length() < 160) regel += c;
        continue;
      }
      if (regel.length() == 0) {        // lege regel = einde van de headers
        client.stop();
        return gelukt;
      }
      if (regel.startsWith("Date:") || regel.startsWith("date:")) {
        String datum = regel.substring(5);
        datum.trim();
        gelukt = zetTijdUitDatumRegel(datum);
        client.stop();
        return gelukt;
      }
      regel = "";
    }
    if (!client.connected() && !client.available()) break;
    delay(10);
  }
  client.stop();
  Serial.println("[tijd] geen Date-header ontvangen");
  return gelukt;
}

