rowanhout/onairlight/firmware/onair-esp32/onair-esp32.ino
static bool probeerNtp(const char * server1, const char * server2, uint32_t maxWachtMs) {
  configTime(0, 0, server1, server2);
  unsigned long start = millis();
  while (!tijdIsGeldig() && millis() - start < maxWachtMs) {
    delay(500);
    Serial.print(".");
  }
  Serial.println();
  return tijdIsGeldig();
}

// Laatste redmiddel: de bouwtijd van deze firmware. Niet exact, maar ruim
// nauwkeurig genoeg om de geldigheidsperiode van een certificaat te toetsen.
static bool tijdUitBuild() {
  char stempel[40];
  snprintf(stempel, sizeof(stempel), "%s %s", __DATE__, __TIME__);
  struct tm t = {};
  if (strptime(stempel, "%b %d %Y %H:%M:%S", &t) == nullptr) return false;
  time_t epoch = mktime(&t);
  struct timeval tv = { .tv_sec = epoch, .tv_usec = 0 };
  settimeofday(&tv, nullptr);
  return tijdIsGeldig();
}

void synchroniseerTijd() {
  // Werk in UTC, zodat mktime() hierboven geen tijdzone-correctie toepast.
  setenv("TZ", "UTC0", 1);
  tzset();

  // 1) NTP via de ingestelde servers (internet).
  Serial.print("[tijd] NTP ophalen");
  if (probeerNtp(NTP_SERVER_1, NTP_SERVER_2, 8000)) {
    printTijd();
    return;
  }

  // 2) NTP via de router zelf: dat verkeer blijft binnen het eigen netwerk en
  //    wordt dus niet door een internetfilter tegengehouden.
  static char gateway[20] = {0};
  ETH.gatewayIP().toString().toCharArray(gateway, sizeof(gateway));
  if (strlen(gateway) > 0 && strcmp(gateway, "0.0.0.0") != 0) {
    Serial.printf("[tijd] NTP via de router (%s)", gateway);
    if (probeerNtp(gateway, nullptr, 5000)) {
      printTijd();
      return;
    }
  }

  // 3) Tijd uit de Date-header van een gewoon HTTP-antwoord.
  Serial.println("[tijd] NTP mislukt -- nu via HTTP");
  if (tijdViaHttpDate()) {
    printTijd();
    return;
  }

  // 4) Niets werkte: val terug op de bouwdatum van deze firmware.
  Serial.println("[tijd] HTTP mislukt -- val terug op de bouwdatum van de firmware");
  if (tijdUitBuild()) {
    printTijd();
    Serial.println("[tijd] (bij benadering, maar genoeg om het certificaat te toetsen)");
    return;
  }

  Serial.println("[tijd] LET OP: geen tijd gevonden; certificaatvalidatie faalt.");
}

// ===========================================================================
// Netwerk-zelftest
// ===========================================================================
// Bij verbindingsproblemen meldt de WebSocket-library alleen "verbinding
// verbroken" en verzwijgt ze de oorzaak. Deze test meet de keten zelf door.
//
// Harde les uit het debuggen hiervan: een meting die twee dingen tegelijk
// varieert bewijst niets, en een instrument met een verborgen timeout meet
// zichzelf in plaats van het netwerk. Beide fouten hebben hier uren gekost,
// dus elke meting hieronder varieert precies een ding en zet zijn eigen
// timeout expliciet.

// --- losse metingen, elk met precies EEN uitkomst -------------------------
//
// De vorige versie van deze zelftest vergeleek in een keer een andere host EN
// een andere poort, en trok daar een conclusie uit over poorten. Dat kan niet.
// Elke meting hieronder varieert daarom precies een ding.

// Naam opzoeken, apart getimed -- anders telt de DNS-tijd stilzwijgend mee in
// de verbindingstijd en lijkt een snelle server traag.
static bool meetDns(const char * host, IPAddress & uit) {
  unsigned long t0 = millis();
  bool ok = WiFi.hostByName(host, uit);
  if (ok) {
    Serial.printf("[test] dns  %-38s -> %-15s %4lu ms\n",
                  host, uit.toString().c_str(), millis() - t0);
  } else {
    Serial.printf("[test] dns  %-38s -> MISLUKT       %4lu ms\n",
                  host, millis() - t0);
  }
  return ok;
}

// Kale TCP-verbinding naar een IP-adres. Altijd per IP, nooit per naam, zodat
// DNS hier geen rol meer speelt.
static bool meetTcp(const char * wat, IPAddress ip, uint16_t poort) {
  WiFiClient c;
  unsigned long t0 = millis();
  bool ok = c.connect(ip, poort, 6000);
  unsigned long duur = millis() - t0;
  c.stop();
  Serial.printf("[test] tcp  %-22s %-15s :%-5u %-12s %4lu ms\n",
                wat, ip.toString().c_str(), poort,
                ok ? "open" : "GEEN ANTWOORD", duur);
  return ok;
}

// TLS-handshake, met een EIGEN handshake-timeout. Zonder setHandshakeTimeout()
// staat die in deze core hard op 120 seconden; de timeout die je aan connect()
// meegeeft dekt alleen de TCP-verbinding. Daar zijn we twee avonden in gelopen.
static bool meetTls(const char * host, uint16_t poort, bool metControle) {
  WiFiClientSecure c;
  c.setHandshakeTimeout(10);
  if (metControle) {
    c.setCACert(ONAIR_ROOT_CAS);
  } else {
    c.setInsecure();
  }
  unsigned long t0 = millis();
  bool ok = c.connect(host, poort, 6000);
  unsigned long duur = millis() - t0;
  char fout[128] = { 0 };
  if (!ok) c.lastError(fout, sizeof(fout));
  c.stop();
  Serial.printf("[test] tls  %-22s %-38s %-12s %5lu ms %s\n",
                metControle ? "met certificaat" : "zonder certificaat",
                host, ok ? "OK" : "MISLUKT", duur, fout);
  return ok;
}

// Haal een pagina van een paar kilobyte op over gewone HTTP en tel hoeveel
// bytes er daadwerkelijk binnenkomen.
//
// Dit is de meting die "het netwerk laat geen TLS door" onderscheidt van "dit
// bord kan geen grote hoeveelheid data achter elkaar ontvangen". Een TCP-
// verbinding en een DNS-lookup zijn allebei een enkel klein pakketje; de
// eerste keer dat de ESP32 een reeks volle frames op rij moet verwerken is bij
// de certificaatketen in de TLS-handshake. Stokt deze HTTP-download op
// vergelijkbare grootte, dan zit het probleem in het ontvangstpad van de
// Ethernet-controller en niet in TLS.
static void meetHttpDownload(const char * host, uint16_t poort, const char * pad) {
  WiFiClient c;
  unsigned long t0 = millis();
  if (!c.connect(host, poort, 6000)) {
    Serial.printf("[test] http %s:%u -> verbinden mislukt\n", host, poort);
    return;
  }
  c.printf("GET %s HTTP/1.1\r\nHost: %s\r\nConnection: close\r\n"
           "User-Agent: onair-esp32\r\n\r\n", pad, host);

  size_t bytes = 0;
  String statusregel;
  bool statusKlaar = false;
  unsigned long laatsteByte = millis();
  uint8_t buf[512];

  // Stoppen zodra er 5 s lang niets meer komt, of na 20 s in totaal.
  while (millis() - t0 < 20000 && millis() - laatsteByte < 5000) {
    int n = c.available();
    if (n <= 0) { delay(5); continue; }
    int gelezen = c.read(buf, n > (int)sizeof(buf) ? (int)sizeof(buf) : n);
    if (gelezen <= 0) { delay(5); continue; }
    laatsteByte = millis();
    if (!statusKlaar) {
      for (int i = 0; i < gelezen && !statusKlaar; i++) {
        char ch = (char)buf[i];
        if (ch == '\n') statusKlaar = true;
        else if (ch != '\r' && statusregel.length() < 60) statusregel += ch;
      }
    }
    bytes += gelezen;
  }
  bool netjesAf = !c.connected();
  c.stop();

  Serial.printf("[test] http %s:%u%s -> %u bytes in %lu ms, %s [%s]\n",
                host, poort, pad, (unsigned)bytes, millis() - t0,
                netjesAf ? "verbinding netjes afgesloten"
                         : "STOKTE (geen data meer, verbinding nog open)",
                statusregel.c_str());
}

// --- de zelftest ----------------------------------------------------------
//
// Doel: in een oogopslag zien welke van de drie lagen faalt (naam, poort,
// versleuteling) en of dat aan de bestemming of aan het netwerk ligt. Daarom
// altijd meerdere bestemmingen naast elkaar: een meting zonder vergelijking
// zegt niets.
static void netwerkZelftest() {
  Serial.println("[test] ================ netwerk-zelftest ================");

