rowanhout/onairlight/firmware/onair-esp32/onair-esp32.ino
  IPAddress doel, ctrl, dns1;
  bool heeftDoel = meetDns(SERVER_HOST, doel);
  bool heeftCtrl = meetDns(CONTROLE_HOST, ctrl);
  dns1.fromString("1.1.1.1");

  Serial.println("[test] --- kale TCP-verbindingen ---");
  if (heeftDoel) {
    meetTcp("doel", doel, SERVER_PORT);
    // Zelfde IP, andere poort: onderscheidt "deze poort dicht" van
    // "deze bestemming onbereikbaar".
    if (SERVER_PORT != 443) meetTcp("doel, poort 443", doel, 443);
    if (SERVER_PORT != 80)  meetTcp("doel, poort 80", doel, 80);
  }
  if (heeftCtrl) {
    // Andere bestemming, poort 443: onderscheidt "deze bestemming" van
    // "alle bestemmingen".
    meetTcp("controlehost", ctrl, 443);
  }
  // Een derde partij die niets met ons te maken heeft, op een standaardpoort.
  meetTcp("1.1.1.1", dns1, 443);
  // En een hoge poort naar diezelfde derde partij: als hoge poorten echt
  // geblokkeerd zijn, faalt deze terwijl 443 hierboven lukte.
  meetTcp("1.1.1.1, hoge poort", dns1, 8443);

  Serial.println("[test] --- HTTP binnen het eigen netwerk ---");
  // De beslissende meting. Verkeer naar een machine op hetzelfde subnet gaat
  // rechtstreeks over de switch: geen router, geen gateway, geen firewall, geen
  // NAT, geen MTU-versmalling. Lukt een HTTP-verzoek daar ook niet, dan kan het
  // niet meer aan het netwerk liggen en zit de fout in dit bord.
  //
  // Zet LOKALE_TEST_HOST in config.h op het IP van een machine op je LAN en
  // draai daar bijvoorbeeld:  python3 -m http.server 8000
#ifdef LOKALE_TEST_HOST
  meetHttpDownload(LOKALE_TEST_HOST, LOKALE_TEST_PORT, "/");
#else
  Serial.println("[test] overgeslagen -- zet LOKALE_TEST_HOST in config.h");
#endif
  // De gateway zelf, als die toevallig een webpagina serveert. Kost niets en
  // is soms al genoeg: die zit per definitie op het eigen netwerk.
  {
    IPAddress gw = ETH.gatewayIP();
    meetHttpDownload(gw.toString().c_str(), 80, "/");
  }

  Serial.println("[test] --- grote HTTP-download (zonder TLS) ---");
  // De inlogpagina van onze eigen app, in platte tekst via de Railway
  // TCP-proxy: enkele kilobytes, precies de orde van grootte van een
  // certificaatketen. Komt dit compleet binnen, dan kan het bord prima een
  // burst aan en ligt het TLS-probleem ergens anders.
  meetHttpDownload("altaria.proxy.rlwy.net", 35261, "/login");

  Serial.println("[test] --- geheugen voor de TLS-handshake ---");
  // mbedTLS alloceert uitsluitend in INTERN geheugen (PSRAM telt niet mee) en
  // heeft voor een handshake tientallen kilobytes nodig, in een aaneengesloten
  // blok. Is het grootste vrije blok daarvoor te klein, dan faalt de handshake
  // zonder dat er iets mis is met het netwerk.
  Serial.printf("[test] heap intern vrij: %u bytes, grootste blok: %u bytes\n",
                (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT),
                (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));

  Serial.println("[test] --- TLS-handshakes (10 s per poging) ---");
  // Zonder certificaatcontrole eerst: die meet puur of de handshake zelf
  // doorkomt. Lukt dat wel en de variant met certificaat niet, dan is het een
  // certificaatprobleem. Lukt geen van beide, dan komt de handshake niet door.
  meetTls(SERVER_HOST, 443, false);
  meetTls(SERVER_HOST, 443, true);
  // Een bestemming buiten ons eigen domein, om te zien of het aan onze server
  // ligt of aan alle TLS-verkeer op dit netwerk.
  meetTls("one.one.one.one", 443, false);

  Serial.println("[test] ================ einde zelftest =================");
  Serial.println("[test] lezen:");
  Serial.println("[test]  tcp overal open + tls overal mislukt -> ligt aan dit bord,");
  Serial.println("[test]    niet aan het netwerk (twee netwerken, zelfde uitkomst).");
  Serial.println("[test]  http-download STOKTE -> het ontvangstpad van de Ethernet-");
  Serial.println("[test]    controller verliest data bij een burst; TLS is dan het");
  Serial.println("[test]    slachtoffer, niet de dader.");
  Serial.println("[test]  grootste vrije blok onder ~40 KB -> te weinig aaneengesloten");
  Serial.println("[test]    intern geheugen voor een handshake.");
}

// ===========================================================================
// WebSocket-client starten, met terugvalserver
// ===========================================================================
// Een on-air lamp die alleen werkt als het internet het doet, is een on-air
// lamp die tijdens een uitzending kan uitvallen. Daarom kent de firmware twee
// bestemmingen: een primaire (meestal een server op het eigen LAN, die geen
// internet, DNS of certificaten nodig heeft) en een reserve (de cloud). Lukt de
// ene FAILOVER_MS lang niet, dan gaat hij naar de andere, en zo door.
//
// Is er maar een server geconfigureerd, dan blijft het gedrag precies zoals het
// was: eindeloos opnieuw proberen op die ene.

struct Bestemming {
  const char * host;
  uint16_t     poort;
  bool         tls;
};

static const Bestemming BESTEMMINGEN[] = {
  { SERVER_HOST, SERVER_PORT, USE_TLS },
#ifdef SERVER2_HOST
  { SERVER2_HOST, SERVER2_PORT, SERVER2_TLS },
#endif
};
static const uint8_t AANTAL_BESTEMMINGEN =
    sizeof(BESTEMMINGEN) / sizeof(BESTEMMINGEN[0]);

// Hoe lang we een bestemming de kans geven voordat we de andere proberen.
#ifndef FAILOVER_MS
  #define FAILOVER_MS 30000
#endif

static uint8_t       actieveBestemming = 0;
static unsigned long pogingGestart     = 0;

void startWebSocket() {
  const Bestemming & b = BESTEMMINGEN[actieveBestemming];

  // Bouw het pad inclusief URL-geencodeerde query-parameters.
  String pad = "/ws/device";
  pad += "?id=" + urlEncode(LAMP_ID);
  pad += "&naam=" + urlEncode(LAMP_NAAM);
  pad += "&ruimte=" + urlEncode(LAMP_RUIMTE);

  Serial.printf("[ws] verbinden met %s://%s:%u%s\n",
                b.tls ? "wss" : "ws", b.host, b.poort, pad.c_str());

  if (b.tls) {
    // wss:// - versleuteld EN het servercertificaat wordt gevalideerd tegen de
    // roots in certs.h. We gebruiken bewust beginSslWithCA() en niet beginSSL():
    // afhankelijk van de libraryversie zet beginSSL() de "insecure" modus niet,
    // waardoor de handshake faalt met "start_ssl_client: -1".
    ws.beginSslWithCA(b.host, b.poort, pad.c_str(), ONAIR_ROOT_CAS);
  } else {
    // ws:// - onversleuteld, simpel en robuust op een vertrouwd LAN.
    ws.begin(b.host, b.poort, pad.c_str());
  }

  ws.onEvent(wsEvent);
  ws.setReconnectInterval(3000);   // elke 3s opnieuw proberen bij verbreken
  pogingGestart = millis();
}

// Blijft de huidige bestemming te lang stil, stap dan over op de volgende.
static void bewaakVerbinding() {
  if (AANTAL_BESTEMMINGEN < 2) return;   // niets om naar uit te wijken
  if (ws.isConnected()) {
    pogingGestart = millis();            // verbonden: de klok loopt niet
    return;
  }
  if (millis() - pogingGestart < FAILOVER_MS) return;

  actieveBestemming = (actieveBestemming + 1) % AANTAL_BESTEMMINGEN;
  Serial.printf("[ws] %lu s geen verbinding -- nu bestemming %u van %u\n",
                (unsigned long)(FAILOVER_MS / 1000),
                actieveBestemming + 1, AANTAL_BESTEMMINGEN);
  ws.disconnect();
  startWebSocket();
}

