rowanhout/onairlight/firmware/onair-esp32/onair-esp32.ino
// ===========================================================================
// setup / loop
// ===========================================================================
void setup() {
  Serial.begin(115200);
  delay(200);
  Serial.println();
  Serial.println("====================================");
  Serial.println(" On-Air Lamp firmware");
  Serial.printf("  bord    : %s\n", BOARD_NAAM);
  Serial.printf("  lamp-pin: GPIO %d (active-HIGH)\n", ACTIVE_LAMP_PIN);
  Serial.printf("  lamp-id : %s\n", LAMP_ID);
  Serial.println("====================================");

  // --- VEILIGE DEFAULT: lamp UIT voordat het netwerk start ---
  pinMode(ACTIVE_LAMP_PIN, OUTPUT);
  digitalWrite(ACTIVE_LAMP_PIN, LOW);
  lampAan = false;

  // --- Ethernet starten ---
  WiFi.onEvent(ethEvent);

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  // Arduino-ESP32 core 3.x signatuur
  ETH.begin(OA_PHY_TYPE, OA_PHY_ADDR, OA_PHY_MDC, OA_PHY_MDIO,
            OA_PHY_POWER, OA_CLK_MODE);
#else
  // Arduino-ESP32 core 2.x signatuur
  ETH.begin(OA_PHY_ADDR, OA_PHY_POWER, OA_PHY_MDC, OA_PHY_MDIO,
            OA_PHY_TYPE, OA_CLK_MODE);
#endif

#ifdef STATIC_IP
  // Vast IP-adres in plaats van DHCP.
  {
    IPAddress ip, gw, sn, dns;
    ip.fromString(STATIC_IP);
    gw.fromString(STATIC_GATEWAY);
    sn.fromString(STATIC_SUBNET);
    dns.fromString(STATIC_DNS);
    if (ETH.config(ip, gw, sn, dns)) {
      Serial.printf("[eth] vast IP ingesteld: %s (gw %s, dns %s)\n",
                    STATIC_IP, STATIC_GATEWAY, STATIC_DNS);
    } else {
      Serial.println("[eth] LET OP: vast IP instellen is mislukt");
    }
  }
#endif

  // De WebSocket-client starten we pas zodra Ethernet een IP heeft (zie loop).
  // Eerder starten heeft geen zin: het opzoeken van de servernaam mislukt dan
  // en je krijgt een stroom "DNS Failed"-meldingen.
  Serial.println("[eth] wachten op netwerk (DHCP)...");
}

void loop() {
#ifdef STATIC_IP
  // Bij een vast IP komt het GOT_IP-event niet altijd; zodra de link er is en
  // we een geldig adres hebben, beschouwen we het netwerk als klaar.
  if (!ethVerbonden && ETH.linkUp() && ETH.localIP() != IPAddress(0, 0, 0, 0)) {
    ethVerbonden = true;
    Serial.print("[eth] netwerk klaar (vast IP): ");
    Serial.println(ETH.localIP());
    Serial.print("[eth] DNS      : ");
    Serial.println(ETH.dnsIP());
#ifdef DNS_FALLBACK
    zetDnsFallback();
#endif
  }
#endif

  // Start de WebSocket-client zodra het netwerk klaar is (eenmalig).
  //
  // De zelftest draait hierNA, niet ervoor. Diagnose mag de functie nooit
  // ophouden: de metingen kosten bij elkaar tientallen seconden, en een lamp
  // die daarop staat te wachten is een lamp die uit staat terwijl de studio
  // denkt dat hij aan is.
  if (ethVerbonden && !wsGestart) {
    wsGestart = true;
    // Alleen tijd ophalen als minstens een van de bestemmingen TLS gebruikt.
    // Bij een lamp die op een lokale server draait is dat niet zo, en dan
    // hoeft hij ook niet op een NTP-timeout te wachten.
    bool tlsNodig = false;
    for (uint8_t i = 0; i < AANTAL_BESTEMMINGEN; i++) {
      if (BESTEMMINGEN[i].tls) tlsNodig = true;
    }
    if (tlsNodig) synchroniseerTijd();
    startWebSocket();
#ifdef NET_TEST
    netwerkZelftest();
#endif
  }

  ws.loop();
  if (wsGestart) bewaakVerbinding();

  // Periodieke heartbeat versturen.
  unsigned long nu = millis();
  if (nu - laatsteHeartbeat >= HEARTBEAT_MS) {
    laatsteHeartbeat = nu;
    if (ws.isConnected()) {
      sendPing();
    }
  }
}
